/*
===============================================================================================
 1. x = 10, y  =11, z = 12. এই মান গুলোর জন্য নিচের কোন অপশন গুলো true আর কোনগুলো false ?
===============================================================================================

A. x< 10
==> false
B. y>11
==> false
C. x+y == 21
==> true
D. (x*z)%7 == 1
==> true
E. y<=z
==> true
F. !(x>y)
==> true
G. (x<y) && (y<z)
==>true
H. (x+y+z)%3==1
==> false
I. (x>=y) || (y<z)
==> true
J. (x>y) && (y<z)
==> false
K. !(x%5==0 && y%5==0)
==> true
L. (x<y && z%11==0) || (x%10==0)  
==> true
*/

/* 
======================================================================================================
 4. একটি জাভাস্ক্রিপ্ট প্রোগ্রাম লিখুন যা ৩টি  পূর্ণসংখ্যা নেয়। এবং তাদের মধ্যে থেকে সবচেয়ে বড় পূর্ণসংখ্যা প্রিন্ট করুন।
======================================================================================================

var num1 = 2191;
var num2 = 1320;
var num3 = 630;
if(num1 >= num2 && num1 >= num3) {
    console.log(num1);
}
else if (num2 >= num1 && num2 >= num3) {
    console.log(num2);
}
else {
    console.log(num3);
} */


