/*
===============================================================================================
 1. x = 10, y  =11, z = 12. এই মান গুলোর জন্য নিচের কোন অপশন গুলো true আর কোনগুলো false ?
===============================================================================================

A. x< 10
==> false
B. y>11
==> false
C. x+y == 21
==> true
D. (x*z)%7 == 1
==> true
E. y<=z
==> true
F. !(x>y)
==> true
G. (x<y) && (y<z)
==>true
H. (x+y+z)%3==1
==> false
I. (x>=y) || (y<z)
==> true
J. (x>y) && (y<z)
==> false
K. !(x%5==0 && y%5==0)
==> true
L. (x<y && z%11==0) || (x%10==0)  
==> true
*/


/* ================================================================================================
2. একটি জাভাস্ক্রিপ্ট প্রোগ্রাম লিখ যা যেকোনো ধনাত্মক সংখ্যা ইনপুট দিলে ১প্রিন্ট করবে,এবং শূন্য ইনপুট দিলে ০ প্রিন্ট করবে,
অন্যতায় -১ প্রিন্ট করে।
================================================================================================

var number = prompt("Enter a number: ");
if (number >= 0) {
    if (number == 0) {
        console.log(0);
    } else {
        console.log(1);
    }
} else {
    console.log(-1);
}
*/


/*
============================================================================================
3. আমরা for লুপ ব্যাবহার করে ১ থেকে ১০ এর যোগফল বের করেছি। নিচের ৫টি  ধারা গুলোর যোগফল বের করার জন্য প্রোগ্রাম লিখ।

===A) 1+2+3+.....50 ===
var sum = 0;
for (var i = 1; i <=50; i++) {
    sum = sum + i;
}
console.log(sum);

=== B. 1+3+5+...+29 ( প্রথম ২০টি পদ) ===

50 + 49 + 48 + 47 + …… ( প্রথম ১০টি পদ)
2 + 5 + 8 + 11 + 14 + …..   (প্রথম ১০টি পদ)
100 + 97 + 94 + 91 + ….  (0 এর চেয়ে বড় পর্যন্ত)
===============================================================================================

A.

*/

 


















/* 
================================================================================================
 4. একটি জাভাস্ক্রিপ্ট প্রোগ্রাম লিখুন যা ৩টি  পূর্ণসংখ্যা নেয়। এবং তাদের মধ্যে থেকে সবচেয়ে বড় পূর্ণসংখ্যা প্রিন্ট করুন।
===============================================================================================

var num1 = 2191;
var num2 = 1320;
var num3 = 630;
if(num1 >= num2 && num1 >= num3) {
    console.log(num1);
}
else if (num2 >= num1 && num2 >= num3) {
    console.log(num2);
}
else {
    console.log(num3);
} */



/* ================================================================================================
5. Write a JavaScript program which iterates the integers from 1 to 100. But for multiples of three print "Fizz" instead of the number and for the multiples of five print "Buzz". For numbers which are multiples of both three and five print "FizzBuzz" (এটির বাংলা নিজে নিজে ভালো করে বুঝে তারপর কোড লিখবে, প্রব্লেমটি খুবই সহজ তবে একটু বুঝে সল্ভ করবে ।)
================================================================================================

for(var i = 0; i <= 100; i++){
    if(i%3 == 0){
        console.log('Fizz');
    }
    else if( i%5 == 0){
        console.log('Fuzz');
    }
    else if(i%3 ==0 && i%5 ==0){
        console.log('FizzFuzz');
    }
}

*/

