/*
============================================================================================
3. আমরা for লুপ ব্যাবহার করে ১ থেকে ১০ এর যোগফল বের করেছি। নিচের ৫টি  ধারা গুলোর যোগফল বের করার জন্য প্রোগ্রাম লিখ।

===A) 1+2+3+.....50 ===
var sum = 0;
for (var i = 1; i <=50; i++) {
    sum = sum + i;
}
console.log(sum);

=== B. 1+3+5+...+39 ( প্রথম ২০টি পদ) ===
var sum = 0;
for (var i = 1; i <=39; i+=2){
    sum = sum + i;
}
console.log(sum);


=== C. 50 + 49 + 48 + 47 + …… ( প্রথম ১০টি পদ) ===

var sum = 0;
for (var i = 50; i >=41; i--){
    sum = sum + i;
}
console.log(sum);

===== D. 2 + 5 + 8 + 11 + 14 + …..   (প্রথম ১০টি পদ)

var sum = 0;
for (var i = 2; i <=29; i+=3){
    sum = sum + i;
}
console.log(sum);

=== E. 100 + 97 + 94 + 91 + …. (0 এর চেয়ে বড় পর্যন্ত) ===
var sum = 0;
for (var i = 100; i >=0; i-=3) {
    sum = sum + i;
}
console.log(sum); 
===============================================================================================
*/