/* 
================================================================================================
 4. একটি জাভাস্ক্রিপ্ট প্রোগ্রাম লিখুন যা ৩টি  পূর্ণসংখ্যা নেয়। এবং তাদের মধ্যে থেকে সবচেয়ে বড় পূর্ণসংখ্যা প্রিন্ট করুন।
===============================================================================================

var num1 = 2191;
var num2 = 1320;
var num3 = 630;
if(num1 >= num2 && num1 >= num3) {
    console.log(num1);
}
else if (num2 >= num1 && num2 >= num3) {
    console.log(num2);
}
else {
    console.log(num3);
} */