/* ================================================================================================
2. একটি জাভাস্ক্রিপ্ট প্রোগ্রাম লিখ যা যেকোনো ধনাত্মক সংখ্যা ইনপুট দিলে ১প্রিন্ট করবে,এবং শূন্য ইনপুট দিলে ০ প্রিন্ট করবে,
অন্যতায় -১ প্রিন্ট করে।
================================================================================================

var number = prompt("Enter a number: ");
if (number >= 0) {
    if (number == 0) {
        console.log(0);
    } else {
        console.log(1);
    }
} else {
    console.log(-1);
}
*/